{"keras_version": "2.1.2", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, null, null, 3], "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_3", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_4", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "filters": 80, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_5", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 192, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_9", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_7", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 48, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_10", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "same", "name": "average_pooling2d_1"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_6", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_8", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [5, 5], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_11", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_12", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed0", "config": {"trainable": true, "name": "mixed0", "axis": 3}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_16", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_14", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 48, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_17", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "same", "name": "average_pooling2d_2"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_13", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_15", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [5, 5], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_18", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_19", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed1", "config": {"trainable": true, "name": "mixed1", "axis": 3}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_23", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23"}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_23", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_21", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 48, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_24", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21"}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_24", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "config": {"strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "same", "name": "average_pooling2d_3"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_20", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_22", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [5, 5], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_25", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_26", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_26", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20"}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_22"}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26"}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_22", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_25", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_26", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed2", "config": {"trainable": true, "name": "mixed2", "axis": 3}, "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_28", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_28", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28"}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_28", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_29", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_29", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29"}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_29", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_27", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_27", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 384, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_30", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_30", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27"}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30"}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_27", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_30", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "valid", "name": "max_pooling2d_3"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed3", "config": {"trainable": true, "name": "mixed3", "axis": 3}, "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_35", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_35", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35"}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_35", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_36", "config": {"data_format": "channels_last", "use_bias": false, "name": "conv2d_36", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [7, 1], "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"beta_constraint": null, "center": true, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_36"}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_36", "config": {"activation": "relu", "trainable": true, "name": "activation_36"}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_32", "config": {"data_format": "channels_last", 