{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        3
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "sparse": false
                },
                "inbound_nodes": [
                ],
                "name": "input_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_1",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_1",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_1",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_2",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_2"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_2",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_2",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_2"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_3",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_3"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_3",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_3"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_3",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_3",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_3"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_1",
                    "padding": "valid",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "max_pooling2d_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 80,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_4",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_4"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_4",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_4"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_4",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_4",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_4"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 192,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_5",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_5"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_5",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_5"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_5",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_5",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_5"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_2",
                    "padding": "valid",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_5",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "max_pooling2d_2"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_9",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_9"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_9",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_9",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_9"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_9",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_9",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_9"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 48,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_7",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_7"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 96,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_10",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_9",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_10"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_7",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_7",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_7"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_10",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_10",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_10"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_7",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_7",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_7"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_10",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_10",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "activation_10"
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "average_pooling2d_1",
                    "padding": "same",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "average_pooling2d_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_6",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_6"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "name": "conv2d_8",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_7",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_8"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 96,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_11",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_10",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_11"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_12",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_1",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "conv2d_12"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_6",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_6",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_6"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_8",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_8",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_8"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "name": "batch_normalization_11",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_11",
                            0,
                            0,
                            {
                            }
                        ]
                    ]
                ],
                "name": "batch_normalization_11"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {
                        }
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {
                        }
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
