{"keras_version": "2.1.2", "class_name": "Model", "config": {"input_layers": [["input_anchor", 0, 0], ["input_positive", 0, 0], ["input_negative", 0, 0]], "output_layers": [["triplet_loss", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_anchor", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_anchor", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "input_positive", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_positive", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "input_negative", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_negative", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Model", "name": "model_1", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null, null, 3], "name": "input_1", "dtype": "float32"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1"}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_1"}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2"}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_2"}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3"}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_3"}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "filters": 80, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4"}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_4"}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 192, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5"}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_5"}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_9"}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_9"}, "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 48, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7"}, "name": "conv2d_7"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_10"}, "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_7"}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_10"}, "name": "batch_normalization_10"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "same", "name": "average_pooling2d_1"}, "name": "average_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6"}, "name": "conv2d_6"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [5, 5], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8"}, "name": "conv2d_8"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_11"}, "name": "conv2d_11"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 32, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_12"}, "name": "conv2d_12"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_6"}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_8"}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_11"}, "name": "batch_normalization_11"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_12"}, "name": "batch_normalization_12"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_16"}, "name": "conv2d_16"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_16"}, "name": "batch_normalization_16"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "name": "activation_16"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 48, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_14"}, "name": "conv2d_14"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_17"}, "name": "conv2d_17"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_14"}, "name": "batch_normalization_14"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_17"}, "name": "batch_normalization_17"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "name": "activation_14"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "name": "activation_17"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "same", "name": "average_pooling2d_2"}, "name": "average_pooling2d_2"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_13"}, "name": "conv2d_13"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [5, 5], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_15"}, "name": "conv2d_15"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_18"}, "name": "conv2d_18"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_19"}, "name": "conv2d_19"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_13"}, "name": "batch_normalization_13"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_15"}, "name": "batch_normalization_15"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_18"}, "name": "batch_normalization_18"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_19"}, "name": "batch_normalization_19"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "name": "activation_13"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "name": "activation_15"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "name": "activation_18"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "name": "activation_19"}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_23"}, "name": "conv2d_23"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_23"}, "name": "batch_normalization_23"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "name": "activation_23"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 48, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_21"}, "name": "conv2d_21"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_24"}, "name": "conv2d_24"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_21"}, "name": "batch_normalization_21"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_24"}, "name": "batch_normalization_24"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "name": "activation_21"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "name": "activation_24"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "same", "name": "average_pooling2d_3"}, "name": "average_pooling2d_3"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_20"}, "name": "conv2d_20"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [5, 5], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_22"}, "name": "conv2d_22"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_25"}, "name": "conv2d_25"}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_26"}, "name": "conv2d_26"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_20"}, "name": "batch_normalization_20"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_22"}, "name": "batch_normalization_22"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_25"}, "name": "batch_normalization_25"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_26"}, "name": "batch_normalization_26"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "name": "activation_20"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "name": "activation_22"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "name": "activation_25"}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "name": "activation_26"}, {"inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_28"}, "name": "conv2d_28"}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_28"}, "name": "batch_normalization_28"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "name": "activation_28"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_29"}, "name": "conv2d_29"}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_29"}, "name": "batch_normalization_29"}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "name": "activation_29"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 384, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_27"}, "name": "conv2d_27"}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 96, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_30"}, "name": "conv2d_30"}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_27"}, "name": "batch_normalization_27"}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_30"}, "name": "batch_normalization_30"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "name": "activation_27"}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "name": "activation_30"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "valid", "name": "max_pooling2d_3"}, "name": "max_pooling2d_3"}, {"inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed3", "axis": 3}, "name": "mixed3"}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_35"}, "name": "conv2d_35"}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_35"}, "name": "batch_normalization_35"}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "name": "activation_35"}, {"inbound_nodes": [[["activation_35", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [7, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_36"}, "name": "conv2d_36"}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, 