{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_anchor"}, "name": "input_anchor"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_positive"}, "name": "input_positive"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_negative"}, "name": "input_negative"}, {"inbound_nodes": [[["input_anchor", 0, 0, {}]], [["input_positive", 0, 0, {}]], [["input_negative", 0, 0, {}]]], "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_1", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_2", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_3", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_3", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 80, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_4", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_4", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 192, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_5", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_5", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_9", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_9", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 48, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_7", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_7"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_10", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_7", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_10", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_10"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "same", "trainable": true, "pool_size": [3, 3], "name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_6", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_6"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [5, 5], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_8", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_8"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_11", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_11"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_12", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_12"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_6", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_8", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_11", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_11"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_12", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_12"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed0"}, "name": "mixed0"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_16", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_16"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_16", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_16"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "name": "activation_16"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 48, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_14", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_14"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_17", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_17"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_14", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_14"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_17", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_17"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "name": "activation_14"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "name": "activation_17"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "same", "trainable": true, "pool_size": [3, 3], "name": "average_pooling2d_2", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_2"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_13", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_13"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [5, 5], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_15", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_15"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_18", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_18"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_19", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_19"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_13", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_13"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_15", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_15"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_18", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_18"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_19", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_19"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "name": "activation_13"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "name": "activation_15"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "name": "activation_18"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "name": "activation_19"}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed1"}, "name": "mixed1"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_23", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_23"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_23", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_23"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "name": "activation_23"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 48, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_21", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_21"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_24", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_24"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_21", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_21"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_24", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_24"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "name": "activation_21"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "name": "activation_24"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "same", "trainable": true, "pool_size": [3, 3], "name": "average_pooling2d_3", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_3"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_20", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_20"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [5, 5], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_22", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_22"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_25", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_25"}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_26", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_26"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_20", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_20"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_22", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_22"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_25", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_25"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_26", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_26"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "name": "activation_20"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "name": "activation_22"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "name": "activation_25"}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "name": "activation_26"}, {"inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed2"}, "name": "mixed2"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_28", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_28"}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_28", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_28"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "name": "activation_28"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_29", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_29"}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_29", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_29"}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "name": "activation_29"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 384, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_27", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_27"}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_30", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_30"}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_27", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_27"}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_30", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_30"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "name": "activation_27"}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "name": "activation_30"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3"}, {"inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed3"}, "name": "mixed3"}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_35", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_35"}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": 3, "name": "batch_normalization_35", "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null}, "name": "batch_normalization_35"}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "name": "activation_35"}, {"inbound_nodes": [[["activation_35", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128, "kernel_size": [7, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_36", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_36"}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, 