{"keras_version": "2.1.2", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "valid", "filters": 32, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "valid", "filters": 32, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_1"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "valid", "filters": 80, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "valid", "filters": 192, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_5", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_2"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_9", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 48, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_7", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_10", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"strides": [1, 1], "padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_1"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_6", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_8", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_11", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_12", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed0", "config": {"trainable": true, "name": "mixed0", "axis": 3}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_16", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_16", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "name": "activation_16", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 48, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_14", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_17", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_17", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "name": "activation_17", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"strides": [1, 1], "padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_2"}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_13", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_15", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_18", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_19", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_15", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_18", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_19", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "name": "activation_18", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "name": "activation_19", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed1", "config": {"trainable": true, "name": "mixed1", "axis": 3}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_23", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_23", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "name": "activation_23", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 48, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_21", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_24", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_21", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_24", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "name": "activation_21", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "name": "activation_24", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_3", "config": {"strides": [1, 1], "padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_3"}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_20", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_22", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_25", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_25", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_26", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_26", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_20", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_22", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_25", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_26", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "name": "activation_20", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "name": "activation_22", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "name": "activation_25", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "name": "activation_26", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}}, {"inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed2", "config": {"trainable": true, "name": "mixed2", "axis": 3}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_28", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_28", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_28", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "name": "activation_28", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_29", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_29", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_29", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "name": "activation_29", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_27", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "valid", "filters": 384, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_27", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_30", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "valid", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_30", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_27", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_30", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "name": "activation_27", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation", "name": "activation_30", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_3"}}, {"inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed3", "config": {"trainable": true, "name": "mixed3", "axis": 3}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_35", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_35", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_35", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Activation", "name": "activation_35", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}}, {"inbound_nodes": [[["activation_35", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_36", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": true, "kernel_size": [7, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_36", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_36", "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": false}}, {"inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "class_name": "Activation", "name": "activation_36", "config": {"activation": "relu", "trainable": true, "name": "activation_36"}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_32", "config": 