{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "valid", "name": "conv2d_1", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2]}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "valid", "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_3", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [3, 3], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 80, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "valid", "name": "conv2d_4", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 192, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "valid", "name": "conv2d_5", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [3, 3], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_9", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 48, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_7", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_10", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_1", "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last"}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_6", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_8", "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_11", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_12", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed0"}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_16", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 48, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_14", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_17", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_2", "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last"}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_13", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_15", "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_18", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_19", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed1"}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_23", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 48, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_21", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_24", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_3", "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last"}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_20", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_22", "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_25", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_26", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_25"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed2"}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_28", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_28"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_29", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_29"}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 384, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "valid", "name": "conv2d_27", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2]}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "valid", "name": "conv2d_30", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2]}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_27"}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_30"}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [3, 3], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed3"}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_35", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_35"}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false, "activation": "linear", "padding": "same", "name": "conv2d_36", "bias_regularizer": null, "kernel_size": [7, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_36"}, "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, 