{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "filters": 32}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_1", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "filters": 32}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_2", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_3", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_4", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "filters": 80}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_4", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_5", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "filters": 192}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_5", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_9", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_9", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_7", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 48}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_10", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 96}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_7", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_10", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_6", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_8", "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_11", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 96}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_12", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 32}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_6", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_8", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_11", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_12", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_16", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_16", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": true}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_14", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 48}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_17", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 96}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_14", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_17", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": true}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_13", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_15", "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_18", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 96}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_19", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_13", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_15", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_18", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_19", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": true}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": true}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": true}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_23", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_23", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_23", "trainable": true}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_21", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 48}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_24", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 96}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_21", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_24", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_21", "trainable": true}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_24", "trainable": true}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_20", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_22", "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_25", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 96}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_26", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_20", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_22", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_25", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_26", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_20", "trainable": true}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_22", "trainable": true}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_25", "trainable": true}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": true}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_28", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 64}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_28", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": true}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_29", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 96}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_29", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": true}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_27", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "filters": 384}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_30", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "filters": 96}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_27", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_30", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": true}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": true}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed3", "axis": 3}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_35", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 128}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_35", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_35", "trainable": true}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_36", "kernel_constraint": null, "activation": "linear", "kernel_size": [7, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "filters": 128}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "gamma_constraint": null, "name": "batch_normalization_36", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_36", "trainable": true}, "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, 