<<<<<<< Updated upstream
{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, null, null, 3], "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_1", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_1", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_2", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_2", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_3", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_3", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 80, "use_bias": false, "bias_constraint": null, "name": "conv2d_4", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_4", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 192, "use_bias": false, "bias_constraint": null, "name": "conv2d_5", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_5", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_9", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_9", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 48, "use_bias": false, "bias_constraint": null, "name": "conv2d_7", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_10", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_7", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_10", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "average_pooling2d_1", "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3]}, "class_name": "AveragePooling2D"}, {"name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_6", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_8", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_11", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_12", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_6", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_8", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_11", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_12", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"name": "mixed0", "trainable": true, "axis": 3}, "class_name": "Concatenate"}, {"name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_16", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_16", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 48, "use_bias": false, "bias_constraint": null, "name": "conv2d_14", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_17", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_14", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_17", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "average_pooling2d_2", "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3]}, "class_name": "AveragePooling2D"}, {"name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_13", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_15", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_18", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_19", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_13", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_15", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_18", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_19", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "mixed1", "trainable": true, "axis": 3}, "class_name": "Concatenate"}, {"name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_23", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_23", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 48, "use_bias": false, "bias_constraint": null, "name": "conv2d_21", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_24", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_21", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_24", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "average_pooling2d_3", "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3]}, "class_name": "AveragePooling2D"}, {"name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_20", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_22", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_25", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_26", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_20", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_22", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_25", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_26", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"name": "mixed2", "trainable": true, "axis": 3}, "class_name": "Concatenate"}, {"name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_28", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_28", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_29", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_29", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 384, "use_bias": false, "bias_constraint": null, "name": "conv2d_27", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "strides": [2, 2], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_30", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_27", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_30", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "mixed3", "trainable": true, "axis": 3}, "class_name": "Concatenate"}, {"name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 128, "use_bias": false, "bias_constraint": null, "name": "conv2d_35", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_35", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"name": "activation_35", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"kernel_size": [7, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 128, "use_bias": false, "bias_constraint": null, "name": "conv2d_36", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_36", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"name": "activation_36", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_32", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"kernel_size": [1, 1],