{"class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_1", "activation": "linear", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_1", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_2", "activation": "linear", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_2", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_3", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_3", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_4", "activation": "linear", "filters": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_4", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_5", "activation": "linear", "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_5", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_9", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_9", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_7", "activation": "linear", "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_10", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_7", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_10", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_1", "trainable": true, "padding": "same"}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_6", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_8", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_11", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_12", "activation": "linear", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_6", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_8", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_11", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_12", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_16", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_16", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_14", "activation": "linear", "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_17", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_14", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_17", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_2", "trainable": true, "padding": "same"}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_13", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_15", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_18", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_19", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_13", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_15", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_18", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_19", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_23", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_23", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_21", "activation": "linear", "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_24", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_21", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_24", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_3", "trainable": true, "padding": "same"}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_20", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_22", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_25", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_26", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_20", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_22", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_25", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_26", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_28", "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_28", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_29", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_29", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_27", "activation": "linear", "filters": 384, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_30", "activation": "linear", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_27", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_30", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "padding": "valid"}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed3", "axis": 3}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_35", "activation": "linear", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_35", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_35", "activation": "relu"}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_36", "activation": "linear", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [7, 1], "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_36", "center": true, "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null}, "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_36", "activation": "relu"}, "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_32", "activation": "linear", "filters": 128, 