{"class_name": "Model", "keras_version": "2.1.2", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 3], "dtype": "float32"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_1", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_2", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_3", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "pool_size": [3, 3]}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "filters": 80, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_4", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "filters": 192, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_5", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "pool_size": [3, 3]}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_9", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_9", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_7", "bias_regularizer": null, "filters": 48, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_10", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_7", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_10", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_1", "trainable": true, "padding": "same", "pool_size": [3, 3]}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_6", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_8", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_11", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_12", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_6", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_8", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_11", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_12", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"name": "mixed0", "class_name": "Concatenate", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed0", "trainable": true}}, {"name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_16", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_16", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_14", "bias_regularizer": null, "filters": 48, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_17", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_14", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_17", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": true, "activation": "relu"}}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_2", "trainable": true, "padding": "same", "pool_size": [3, 3]}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_13", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_15", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_18", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_19", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_13", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_15", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_18", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_19", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": true, "activation": "relu"}}, {"name": "activation_19", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": true, "activation": "relu"}}, {"name": "mixed1", "class_name": "Concatenate", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed1", "trainable": true}}, {"name": "conv2d_23", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_23", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_23", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_23", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"name": "activation_23", "trainable": true, "activation": "relu"}}, {"name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_21", "bias_regularizer": null, "filters": 48, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_24", "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_24", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_21", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_24", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_21", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"name": "activation_21", "trainable": true, "activation": "relu"}}, {"name": "activation_24", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "activation_24", "trainable": true, "activation": "relu"}}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_3", "trainable": true, "padding": "same", "pool_size": [3, 3]}}, {"name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_20", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_22", "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_22", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_25", "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_25", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_26", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_26", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_20", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_22", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_25", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_26", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_20", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"name": "activation_20", "trainable": true, "activation": "relu"}}, {"name": "activation_22", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"name": "activation_22", "trainable": true, "activation": "relu"}}, {"name": "activation_25", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"name": "activation_25", "trainable": true, "activation": "relu"}}, {"name": "activation_26", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"name": "activation_26", "trainable": true, "activation": "relu"}}, {"name": "mixed2", "class_name": "Concatenate", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed2", "trainable": true}}, {"name": "conv2d_28", "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_28", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_28", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_28", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"name": "activation_28", "trainable": true, "activation": "relu"}}, {"name": "conv2d_29", "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_29", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_29", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_29", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"name": "activation_29", "trainable": true, "activation": "relu"}}, {"name": "conv2d_27", "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_27", "bias_regularizer": null, "filters": 384, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "conv2d_30", "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_30", "bias_regularizer": null, "filters": 96, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_27", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_30", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_27", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"name": "activation_27", "trainable": true, "activation": "relu"}}, {"name": "activation_30", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"name": "activation_30", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "padding": "valid", "pool_size": [3, 3]}}, {"name": "mixed3", "class_name": "Concatenate", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed3", "trainable": true}}, {"name": "conv2d_35", "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_35", "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_35", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_35", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"name": "activation_35", "trainable": true, "activation": "relu"}}, {"name": "conv2d_36", "class_name": "Conv2D", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_constraint": null, "name": "conv2d_36", "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "kernel_size": [7, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_36", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": 3, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null}}, {"name": "activation_36", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"name": "activation_36", "trainable": true, "activation": "relu"}}, {"name": "conv2d_32", "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": 