{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.2", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 3]}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_1", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "filters": 32, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"name": "conv2d_2", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 32, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"name": "conv2d_3", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid"}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "conv2d_4", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 80, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "conv2d_5", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 192, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid"}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_9", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_7", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 48, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"name": "conv2d_10", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "average_pooling2d_1", "strides": [1, 1], "trainable": true, "pool_size": [3, 3], "padding": "same"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_6", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"name": "conv2d_8", "kernel_regularizer": null, "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"name": "conv2d_11", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"name": "conv2d_12", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 32, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "mixed0"}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "conv2d_16", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_16"}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "conv2d_14", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 48, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"name": "conv2d_17", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_17"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "average_pooling2d_2", "strides": [1, 1], "trainable": true, "pool_size": [3, 3], "padding": "same"}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "conv2d_13", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"name": "conv2d_15", "kernel_regularizer": null, "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"name": "conv2d_18", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_19", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_15"}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_18"}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_19"}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "mixed1"}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "conv2d_23", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_23"}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "conv2d_21", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 48, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"name": "conv2d_24", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_21"}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_24"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "average_pooling2d_3", "strides": [1, 1], "trainable": true, "pool_size": [3, 3], "padding": "same"}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "conv2d_20", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"name": "conv2d_22", "kernel_regularizer": null, "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"name": "conv2d_25", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"name": "conv2d_26", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_20"}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_22"}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_25"}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_26"}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "mixed2"}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "conv2d_28", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_28"}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"name": "conv2d_29", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_29"}}, {"class_name": "Conv2D", "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "conv2d_27", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "filters": 384, "bias_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"name": "conv2d_30", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "filters": 96, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_27"}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_30"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid"}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "mixed3"}}, {"class_name": "Conv2D", "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"name": "conv2d_35", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 128, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_35"}}, {"class_name": "Conv2D", "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"name": "conv2d_36", "kernel_regularizer": null, "kernel_size": [7, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 128, "bias_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"axis": 3, "name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_36"}}, {"class_name": "Conv2D", "name": "conv2d_32", 