{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_anchor", "inbound_nodes": [], "config": {"name": "input_anchor", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false}}, {"class_name": "InputLayer", "name": "input_positive", "inbound_nodes": [], "config": {"name": "input_positive", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false}}, {"class_name": "InputLayer", "name": "input_negative", "inbound_nodes": [], "config": {"name": "input_negative", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false}}, {"class_name": "Model", "name": "model_1", "inbound_nodes": [[["input_anchor", 0, 0, {}]], [["input_positive", 0, 0, {}]], [["input_negative", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 32, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 32, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 80, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 192, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 48, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_1", "strides": [1, 1], "padding": "same"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 32, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"name": "mixed0", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_16", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 48, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_17", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"name": "activation_17", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_2", "strides": [1, 1], "padding": "same"}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_18", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_19", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"name": "activation_19", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "mixed1", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_23", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"name": "activation_23", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_21", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 48, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_24", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"name": "activation_21", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "activation_24", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_3", "strides": [1, 1], "padding": "same"}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_20", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_22", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_25", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_26", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_22", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"name": "activation_20", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"name": "activation_22", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"name": "activation_25", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"name": "activation_26", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"name": "mixed2", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_28", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"name": "activation_28", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_29", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"name": "activation_29", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_27", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 384, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_30", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 96, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"name": "activation_27", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"name": "activation_30", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "mixed3", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_35", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 128, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35", "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"name": "activation_35", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_36", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [7, 1], "activation": "linear", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 128, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", 