{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2", "config": {"input_layers": [["input_anchor", 0, 0], ["input_positive", 0, 0], ["input_negative", 0, 0]], "output_layers": [["triplet_loss", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_anchor"}, "name": "input_anchor", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_positive"}, "name": "input_positive", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_negative"}, "name": "input_negative", "inbound_nodes": []}, {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, null, null, 3]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_1", "padding": "valid", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 32}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_2", "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 32}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_3", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_4", "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 80}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_5", "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 192}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_9", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_7", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 48}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_10", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_6", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_8", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_11", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_12", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 32}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed0", "trainable": true}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_16", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": true}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_14", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 48}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_17", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": true}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_13", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_15", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_18", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_19", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": true}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": true}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": true}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed1", "trainable": true}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_23", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_23", "trainable": true}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_21", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 48}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_24", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_21", "trainable": true}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_24", "trainable": true}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_20", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_22", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_25", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_26", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_20", "trainable": true}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_22", "trainable": true}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_25", "trainable": true}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": true}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed2", "trainable": true}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_28", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_28", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": true}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_29", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_29", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": true}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_27", "padding": "valid", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 384}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_30", "padding": "valid", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "filters": 96}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_27", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_30", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": true}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": true}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed3", "trainable": true}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_35", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "filters": 128}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_35", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_35", "trainable": true}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_36", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [7, 1], "trainable": true, "bias_constraint": null, "filters": 128}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_mean_initializer": {"class_name": 