{"keras_version": "2.1.2", "config": {"output_layers": [["triplet_loss", 0, 0]], "input_layers": [["input_anchor", 0, 0], ["input_positive", 0, 0], ["input_negative", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_anchor", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_anchor", "sparse": false}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_positive", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_positive", "sparse": false}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_negative", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_negative", "sparse": false}}, {"inbound_nodes": [[["input_anchor", 0, 0, {}]], [["input_positive", 0, 0, {}]], [["input_negative", 0, 0, {}]]], "class_name": "Model", "name": "model_1", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "filters": 32, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_1", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1", "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "filters": 32, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_2", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2", "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_3", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3", "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_1"}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "filters": 80, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_4", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4", "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "filters": 192, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_5", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_5", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5", "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_2"}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_9", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_9", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_9", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_9", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9", "class_name": "Activation"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 48, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_7", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_7", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_10", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_10", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_7", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_7", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_10", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_10", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10", "class_name": "Activation"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_1"}, "name": "average_pooling2d_1", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_6", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_8", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_8", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_11", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_11", "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 32, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_12", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_12", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_6", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_6", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_8", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_8", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_11", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_11", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_12", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_12", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12", "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0", "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_16", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_16", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_16", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_16", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "name": "activation_16", "class_name": "Activation"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 48, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_14", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_14", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_17", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_17", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_14", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_14", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_17", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_17", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "name": "activation_14", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "name": "activation_17", "class_name": "Activation"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_2"}, "name": "average_pooling2d_2", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_13", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_13", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_15", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_15", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_18", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_18", "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_19", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_19", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_13", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_13", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_15", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_15", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_18", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_18", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_19", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_19", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "name": "activation_13", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "name": "activation_15", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "name": "activation_18", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "name": "activation_19", "class_name": "Activation"}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1", "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_23", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_23", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_23", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_23", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "name": "activation_23", "class_name": "Activation"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 48, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_21", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_21", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_24", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_24", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_21", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_21", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_24", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_24", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "name": "activation_21", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "name": "activation_24", "class_name": "Activation"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_3"}, "name": "average_pooling2d_3", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_20", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_20", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_22", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_22", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_25", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_25", "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_26", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_26", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_20", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_20", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_22", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_22", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_25", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_25", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_26", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_26", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "name": "activation_20", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "name": "activation_22", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "name": "activation_25", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "name": "activation_26", "class_name": "Activation"}, {"inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2", "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_28", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_28", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_28", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_28", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "name": "activation_28", "class_name": "Activation"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_29", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_29", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_29", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_29", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "name": "activation_29", "class_name": "Activation"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "filters": 384, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_27", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_27", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "filters": 96, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_30", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_30", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_27", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_27", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_30", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_30", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "name": "activation_27", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "name": "activation_30", "class_name": "Activation"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_3"}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed3", "axis": 3}, "name": "mixed3", "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_35", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_35", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batch_normalization_35", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "scale": false}, "name": "batch_normalization_35", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "name": "activation_35", "class_name": "Activation"}, {"inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "filters": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "trainable": true, "kernel_size": [7, 1], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_36", "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null}, "name": "conv2d_36", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_36",