{"class_name": "Model", "config": {"input_layers": [["input_anchor", 0, 0], ["input_positive", 0, 0], ["input_negative", 0, 0]], "output_layers": [["triplet_loss", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_anchor", "sparse": false}, "name": "input_anchor", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_positive", "sparse": false}, "name": "input_positive", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_negative", "sparse": false}, "name": "input_negative", "inbound_nodes": []}, {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 32, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 32, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_2", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_3", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [3, 3], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 80, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_4", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_4", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 192, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_5", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_5", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [3, 3], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_9", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_9", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 48, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_7", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_10", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_7", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_10", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_1", "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_6", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_8", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_11", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 32, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_12", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_6", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_8", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_11", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_12", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed0"}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "mixed0"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_16", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_16", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 48, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_14", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_17", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_14", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_17", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_2", "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_13", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_15", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_18", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_19", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_13", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_15", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_18", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_19", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed1"}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "mixed1"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_23", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_23", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 48, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_21", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_24", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_21", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_24", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24"}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_3", "pool_size": [3, 3], "trainable": true, "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_20", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_22", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_25", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_26", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_20", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_22", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_25", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_26", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_25"}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "activation_25"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed2"}, "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "name": "mixed2"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 64, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_28", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_28", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_28"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_29", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_29", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_29"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "activation_29"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 384, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_27", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 96, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_30", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_27", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_30", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_27"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "activation_27"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_30"}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [3, 3], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed3"}, "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 128, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_35", "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": 3, "name": "batch_normalization_35", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_35"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "activation_35"}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "filters": 128, "activation": "linear", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "name": "conv2d_36", "bias_constraint": null, "kernel_size": [7, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["activation_35", 0, 0, {}]]], "name": "conv2d_36"}, {"class_name": "BatchNormalization", "config": {"scale": false, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": 