{"keras_version": "2.1.2", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_anchor", "inbound_nodes": [], "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_anchor", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "name": "input_positive", "inbound_nodes": [], "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_positive", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "name": "input_negative", "inbound_nodes": [], "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_negative", "dtype": "float32", "sparse": false}}, {"class_name": "Model", "name": "model_1", "inbound_nodes": [[["input_anchor", 0, 0, {}]], [["input_positive", 0, 0, {}]], [["input_negative", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_1", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "valid", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_2", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_3", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_4", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "valid", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_4", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_5", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "valid", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_5", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_9", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_9", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_7", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_10", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_7", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_10", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "average_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_6", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_8", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_11", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_12", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_6", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_8", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_11", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_12", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"name": "mixed0", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_16", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_16", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_16", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_14", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_17", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_14", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_17", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_17", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "average_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_13", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_15", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_18", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_19", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_13", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_15", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_18", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_19", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_15", "trainable": true}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_18", "trainable": true}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_19", "trainable": true}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "mixed1", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_23", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_23", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_23", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_21", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_24", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_21", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_24", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_21", "trainable": true}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_24", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "average_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_20", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_22", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_25", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_26", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_20", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_22", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_25", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_26", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_20", "trainable": true}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_22", "trainable": true}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_25", "trainable": true}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_26", "trainable": true}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"name": "mixed2", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_28", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_28", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_28", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_29", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_29", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_29", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_27", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_30", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_27", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_30", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_27", "trainable": true}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_30", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "mixed3", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_35", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_35", "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_35", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_36", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [7, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_regularizer": null, "name": 