{"class_name": "Model", "config": {"name": "model_2", "output_layers": [["triplet_loss", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_anchor"}, "name": "input_anchor", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_positive"}, "name": "input_positive", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_negative"}, "name": "input_negative", "inbound_nodes": []}, {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_1", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_1", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_2", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_2", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_3", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_3", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_4", "filters": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_4", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_5", "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_5", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_9", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_9", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_7", "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_10", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_7", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_10", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_1", "trainable": true, "padding": "same"}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_6", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_8", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_11", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_12", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_6", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_8", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_11", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_12", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_16", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_16", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_14", "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_17", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_14", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_17", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_2", "trainable": true, "padding": "same"}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_13", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_15", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_18", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_19", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_13", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_15", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_18", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_19", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_23", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_23", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_21", "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_24", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_21", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_24", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_3", "trainable": true, "padding": "same"}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_20", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_22", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_25", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_26", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_20", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_22", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_25", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_26", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_25"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_28", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_28", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_28"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_29", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_29", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_29"}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_27", "filters": 384, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_30", "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_27", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_30", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_27"}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_30"}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "padding": "valid"}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed3", "axis": 3}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_35", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false, "name": "batch_normalization_35", "gamma_constraint": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_35"}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "name": "conv2d_36", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "kernel_size": [7, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1]}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, 