{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_anchor"}, "name": "input_anchor", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_positive"}, "name": "input_positive", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_negative"}, "name": "input_negative", "inbound_nodes": []}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_1", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_2", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_3", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3]}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 80, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_4", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 192, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_5", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3]}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_9", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 48, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_7", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_10", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_1", "padding": "same", "strides": [1, 1], "pool_size": [3, 3]}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [5, 5], "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_6", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_8", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_11", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_12", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed0"}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_16", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 48, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_17", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_14", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_17", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_2", "padding": "same", "strides": [1, 1], "pool_size": [3, 3]}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [5, 5], "name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_18", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_13", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_15", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_18", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_19", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed1"}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_23", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_23", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 48, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_21", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_24", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_21", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_24", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_3", "padding": "same", "strides": [1, 1], "pool_size": [3, 3]}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_20", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [5, 5], "name": "conv2d_22", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_25", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activation": "linear", "kernel_size": [1, 1], "name": "conv2d_26", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": false}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_20", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_22", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_25", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "scale": false, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_26", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_25"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed2"}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "activation": "relu", "units": 1024, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "activation": "linear", "units": 128, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "name": "model_1", "inbound_nodes": [[["input_anchor", 0, 0, {}]], [["input_positive", 0, 0, {}]], [["input_negative", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape": ["4wEAAAAAAAAABAAAAAMAAABDAAAAcx0AAAB8AABcAwB9AQB9AgB9AwB8AQBkAQAZZAIAZgIAUykD\nTukAAAAA6QEAAACpACkE2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUy2gZzaGFwZTNyAwAAAHIDAAAA\n+hx0Y25fdHJpcGxldGxvc3NfZ2VuZXJhdG9yLnB52hR0cmlwbGV0X291dHB1dF9zaGFwZTYAAABz\nBAAAAAABDwE=\n", null, null], "arguments": {}, "name": "triplet_loss", "output_shape_type": "lambda", "function_type": "lambda", "function": ["4wIAAAAAAAAACQAAAAUAAABDAAAAc4AAAABkAQB9AgB8AABcAwB9AwB9BAB9BQB0AABqAQB0AABq\nAgB8AwB8BAAYgwEAZAIAZAUAgwEBfQYAdAAAagEAdAAAagIAfAMAfAUAGIMBAGQCAGQGAIMBAX0H\nAHQAAGoDAHQAAGoEAGQEAHwGAHwHABh8AQAXgwIAgwEAfQgAfAgAUykHTucAAAAAAADwP9oEYXhp\nc+kBAAAA5wAAAAAAAAAA6f////9yBQAAACkF2gFL2gNzdW3aBnNxdWFyZdoEbWVhbtoHbWF4aW11\nbSkJ2gN2ZWPaBWFscGhh2gRiZXRh2gZhbmNob3LaCHBvc2l0aXZl2ghuZWdhdGl2ZdoDZF9w2gNk\nX27aBGxvc3OpAHIUAAAA+hx0Y25fdHJpcGxldGxvc3NfZ2VuZXJhdG9yLnB52gx0cmlwbGV0X2xv\nc3MeAAAAcwwAAAAAAQYBDwEiASIBIwE=\n", [0.2], null]}, "name": "triplet_loss", "inbound_nodes": [[["model_1", 1, 0, {}], ["model_1", 2, 0, {}], ["model_1", 3, 0, {}]]]}], "output_layers": [["triplet_loss", 0, 0]], "input_layers": [["input_anchor", 0, 0], ["input_positive", 0, 0], ["input_negative", 0, 0]], "name": "model_2"}, "keras_version": "2.1.2"}